# Сценарий использования: выбор товара.

**Цель: выбрать товар из предложенного ассортимента и добавить его в корзину.**

**Акторы: пользователь, система.**

*Основной сценарий:*
1.	Пользователь открывает каталог товаров
2.	Система показывает страницу всех товаров
3.	Пользователь открывает нужный товар
4.	Система показывает страницу карточки товара
5.	Пользователь оставляет товар без изменений и запрашивает добавление его в корзину
6.	Система добавляет выбранную позицию в корзину

*Альтернативный сценарий:*

5. Пользователь открывает вкладку с дополнительными топпингами 
6. Система показывает вкладку со всеми доступными топпингами
7. Пользователь выбирает один/несколько топпингов
8. Система сохраняет изменения и пересчитывает стоимость
9. Пользователь запрашивает добавляет товара в корзину

*Исключение:*

7. Пользователь выбирает один/несколько топпингов
8. Система показывается ошибку, топпинг недоступен
